app/Controllers/Buku.php

SELECT *
FROM `buku`
---
    public function index()
    {
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $buku = $this->bukuModel->search($keyword)->findAll();
        } else {
            $buku = $this->bukuModel->findAll();