app/Controllers/Home.php

public function index()
{
    $db = \Config\Database::connect();

    // Mengambil data real-time dari database
    $data = [
        'totalBuku'   => $db->table('buku')->countAllResults(),
        'totalPinjam' => $db->table('peminjaman')->countAllResults(),
        'nama'        => session()->get('nama')
    ];
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`