app/Controllers/Peminjaman.php

public function selesaikan($id)
{
    $pinjam = $this->pinjamModel->find($id);
    $tgl_kembali = strtotime($pinjam['tgl_kembali']); // Tanggal jatuh tempo
    $tgl_sekarang = time(); // Tanggal hari ini

    $denda = 0;
    if ($tgl_sekarang > $tgl_kembali) {
        $selisih = floor(($tgl_sekarang - $tgl_kembali) / (60 * 60 * 24)); // Hitung selisih hari
        $tarif_denda = 5000; // Contoh tarif Rp 5.000 per hari
        $denda = $selisih * $tarif_denda;
    }

    // Update data peminjaman
    $this->pinjamModel->save([
        'id_peminjaman' => $id,
        'status' => 'kembali',
        'tgl_dikembalikan' => date('Y-m-d'),
        'denda' => $denda
    ]);
---
UPDATE `peminjaman` SET `status` = 'kembali', `tgl_dikembalikan` = '2026-04-28', `denda` = 10000
WHERE `peminjaman`.`id_peminjaman` IN ('52')

    public function tambah($id_buku)
    {
        $buku = $this->bukuModel->find($id_buku);
        if ($buku['stok'] > 0) {
            $this->pinjamModel->save([
                'id_user'     => session()->get('id_user') ?? session()->get('id'),
                'id_buku'     => $id_buku,
                'tgl_pinjam'  => date('Y-m-d'),
                'tgl_kembali' => date('Y-m-d', strtotime('+2 days')),
                'status'      => 'diajukan',
                'denda'       => 0
            ]);

            $this->bukuModel->update($id_buku, ['stok' => $buku['stok'] - 1]);
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '10'
UPDATE `buku` SET `stok` = 8
WHERE `buku`.`id_buku` IN ('10')