app/Models/DendaModel.php

SELECT `denda`.*, `peminjaman`.`tgl_pinjam`, `peminjaman`.`tgl_kembali`, `buku`.`judul`, `users`.`nama`
FROM `denda`
JOIN `peminjaman` ON `peminjaman`.`id_peminjaman` = `denda`.`id_peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `users` ON `users`.`id` = `peminjaman`.`id_user`
WHERE `peminjaman`.`id_user` = '2'
---
    public function getDendaWithDetails($id_user = null)
    {
        $builder = $this->db->table($this->table);
        $builder->select('denda.*, peminjaman.tgl_pinjam, peminjaman.tgl_kembali, buku.judul, users.nama');
        $builder->join('peminjaman', 'peminjaman.id_peminjaman = denda.id_peminjaman');
        $builder->join('buku', 'buku.id_buku = peminjaman.id_buku');
        $builder->join('users', 'users.id = peminjaman.id_user');

        if ($id_user !== null) {
            $builder->where('peminjaman.id_user', $id_user);
        }

        return $builder->get()->getResultArray();