app/Models/PeminjamanModel.php

SELECT `peminjaman`.*, `users`.`nama` as `nama_user`, `buku`.`judul` as `judul_buku`, `buku`.`denda_perhari`
FROM `peminjaman`
JOIN `users` ON `users`.`id` = `peminjaman`.`id_user`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
WHERE `peminjaman`.`id_user` = '2'
ORDER BY `id_peminjaman` DESC
---
    public function getPeminjaman()
    {
        return $this->select('peminjaman.*, users.nama as nama_user, buku.judul as judul_buku, buku.denda_perhari')
                    ->join('users', 'users.id = peminjaman.id_user')
                    ->join('buku', 'buku.id_buku = peminjaman.id_buku')
                    ->orderBy('id_peminjaman', 'DESC')
                    ->findAll();